In [2]:
import pandas as pd
import numpy as np

In [3]:
# Dataframe: represents a rectiangular table of data and contains an ordered collection of columns. Combination of different data types

In [6]:
# constructing a dataframe
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002, 2003],
    'population': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2 ]
}

frame = pd.DataFrame(data)
frame

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9
5  Nevada  2003         3.2

In [7]:
# to select only first five rows 
frame.head()

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9

In [14]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'population'], index=['One', 'Two', 'Three', 'Four', 'Five', 'Six'])

In [15]:
frame2.columns

Index(['year', 'state', 'population'], dtype='object')

In [16]:
# getting specific columns
frame2['year']

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Six      2003
Name: year, dtype: int64

In [17]:
frame2.year

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Six      2003
Name: year, dtype: int64

In [18]:
# getting specific row
frame2.loc['Two']

year          2001
state         Ohio
population     1.7
Name: Two, dtype: object

In [20]:
# ading new column to dataframe
frame2['debt'] = 16.5
frame2

       year   state  population  debt
One    2000    Ohio         1.5  16.5
Two    2001    Ohio         1.7  16.5
Three  2002    Ohio         3.6  16.5
Four   2001  Nevada         2.4  16.5
Five   2002  Nevada         2.9  16.5
Six    2003  Nevada         3.2  16.5

In [22]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  population  debt
One    2000    Ohio         1.5   0.0
Two    2001    Ohio         1.7   1.0
Three  2002    Ohio         3.6   2.0
Four   2001  Nevada         2.4   3.0
Five   2002  Nevada         2.9   4.0
Six    2003  Nevada         3.2   5.0

In [27]:
val = pd.Series([-1, -1.5, -1.7], index=['Two', 'Four', 'Five'])
val

Two    -1.0
Four   -1.5
Five   -1.7
dtype: float64

In [28]:
frame2['debt'] = val
frame2

       year   state  population  debt
One    2000    Ohio         1.5   NaN
Two    2001    Ohio         1.7  -1.0
Three  2002    Ohio         3.6   NaN
Four   2001  Nevada         2.4  -1.5
Five   2002  Nevada         2.9  -1.7
Six    2003  Nevada         3.2   NaN

In [29]:
frame2['eastern'] = frame2.state == 'Ohio'   # mutable
frame2

       year   state  population  debt  eastern
One    2000    Ohio         1.5   NaN     True
Two    2001    Ohio         1.7  -1.0     True
Three  2002    Ohio         3.6   NaN     True
Four   2001  Nevada         2.4  -1.5    False
Five   2002  Nevada         2.9  -1.7    False
Six    2003  Nevada         3.2   NaN    False

In [30]:
# to delete column
del frame2['eastern']
frame2

       year   state  population  debt
One    2000    Ohio         1.5   NaN
Two    2001    Ohio         1.7  -1.0
Three  2002    Ohio         3.6   NaN
Four   2001  Nevada         2.4  -1.5
Five   2002  Nevada         2.9  -1.7
Six    2003  Nevada         3.2   NaN

In [11]:
#nested dicts
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

In [12]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

frame3.T

In [36]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [37]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [3]:
# index objects
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [4]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [5]:
index[1:]

Index(['b', 'c'], dtype='object')

In [6]:
# immutability makes it safer to share index objects among data structure
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [7]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [8]:
obj2.index is labels

True

In [14]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [15]:
'Nevada' in frame3.columns

True